{
	"assignments": [
		{
			"id": 1,
			"label": "Assignment 1",
			"title": "Exploring the Landscape of Data Mining",
			"date": "March 7, 2025",
			"reflection": "While working on this assignment, I deepened my understanding of the various approaches and applications in data mining. It was enlightening to explore both the theoretical underpinnings and the practical implications of mining data to discover meaningful patterns and insights. This exercise improved my analytical thinking and also taught me how to better evaluate data mining models for real-world problems.",
			"link": "midterms/assignment1.pdf"
		},
		{
			"id": 2,
			"label": "Assignment 2",
			"title": "All About Me",
			"date": "March 9, 2025",
			"reflection": "Creating this reflection allowed me to examine my personal and academic journey in data science. It was a chance to tell my goals, the learning styles that resonate with me, and the skills I aim to develop further. I appreciated the opportunity to think about what drives me, such as curiosity and a desire for growth, and how that can shape my learning and future contributions in the field.",
			"link": "midterms/about-me.pdf"
		}
	],

	"activities": [
		{
			"id": 1,
			"label": "Activity 1",
			"title": "Data Mining Scenario Challenge",
			"date": "March 17, 2025",
			"reflection": "This activity gave me hands-on experience in applying data science techniques to real-world urban challenges. I learned how traffic data can be harnessed to enhance city planning and public safety, using time series analysis, classification, and anomaly detection. It was eye-opening to see the role of data in making strategic decisions for smarter urban mobility.",
			"link": "midterms/activity1.pdf"
		},
		{
			"id": 2,
			"label": "Activity 2",
			"title": "Data Mining Scenario Challenge Video Presentation",
			"date": "March 18, 2025",
			"reflection": "Preparing the video presentation allowed me to improve my ability to communicate technical insights in a clear and engaging manner. I learned the importance of storytelling in data science—conveying how data mining techniques like ARIMA forecasting and anomaly detection can lead to impactful changes in traffic management.",
			"link": "https://youtu.be/2p0WsvuolG0"
		},
		{
			"id": 3,
			"label": "Activity 3",
			"title": "Naive Bayesian",
			"date": "April 4, 2025",
			"reflection": "In this activity, I explored the fundamentals of the Naive Bayes classifier and how it can be used in predictive modeling. Working through practical examples helped reinforce the theoretical concepts and showcased the classifier’s strength in handling categorical data efficiently.",
			"link": "midterms/activity3.pdf"
		},
		{
			"id": 4,
			"label": "Activity 4",
			"title": "Naive Bayesian",
			"date": "April 9, 2025",
			"reflection": "This follow-up activity on Naive Bayes deepened my understanding of probabilistic models. By comparing results and tweaking parameters, I learned how model assumptions affect performance and how to interpret classification outputs in context.",
			"link": "midterms/activity4.pdf"
		}
	],
	"quizzes": [
		{
			"id": 1,
			"label": "Pre-Quiz",
			"title": "Data Mining",
			"date": "March 11, 2025",
			"reflection": "The pre-quiz served as a foundational check of my understanding of basic data mining concepts. It helped me identify areas I needed to revisit, such as data types and basic mining techniques. This set the stage for more complex topics and provided a useful benchmark for measuring my progress throughout the course.",
			"link": "midterms/pre-quiz.pdf"
		},
		{
			"id": 2,
			"label": "Quiz 1",
			"title": "Data Mining and Introduction",
			"date": "March 25, 2025",
			"reflection": "Quiz 1 deepened my appreciation for the interdisciplinary nature of data mining. I learned about different kinds of data that can be mined—like time series, spatial, and multimedia data and the corresponding techniques used for each. This broadened my perspective on how data mining can be tailored to various real-world problems.",
			"link": "midterms/quiz1.pdf"
		},
		{
			"id": 3,
			"label": "Long Quiz",
			"title": "Association Rules and Naive Bayesian",
			"date": "April 4, 2025",
			"reflection": "This long quiz allowed me to integrate and apply concepts from different data mining techniques. I explored different datas that can be mind. I also grasped the Naive Bayes classifier’s reliance on probability theory and conditional independence. These concepts not only improved my technical understanding but also demonstrated how to interpret model outputs in meaningful ways.",
			"link": "midterms/longquiz.pdf"
		}
	]
}
