{
	"assignments": [
		{
			"id": 1,
			"label": "Assignment 1",
			"title": "Data Science",
			"date": "October 2, 2024",
			"grade": "19/20",
			"reflection": "This assignment helped me learn the basics of data science. I now understand how important data is for making decisions and how tools like data visualization and prediction can make it easier to understand and use data. This gave me a better idea of what data science is all about and made me more interested in exploring it.",
			"link": "midterms/assignment1.pdf"
		},
		{
			"id": 2,
			"label": "Assignment 2",
			"title": "Operators",
			"date": "October 19, 2024",
			"grade": "20/20",
			"reflection": "This gave me a good idea of how to use operators in R. It showed me how I can use them to solve problems and work with data in a simple way through exploring arithmetic, relational, logical, and other operators. It also helped me understand how to combine different operations to make my code work better.",
			"link": "midterms/assignment2.pdf"
		}
	],
	"activities": [
		{
			"id": 1,
			"label": "All About Me",
			"title": "Introduction",
			"type": "Individual Work",
			"date": "September 29, 2024",
			"grade": "20/20",
			"reflection": "This activity made me think about myself and my goals for this course. Writing about my traits and what I hope to achieve helped me focus on what I want to learn in the field of data science by enabling me to assess my current knowledge on the topics.",
			"link": "midterms/act-allaboutme.pdf"
		},
		{
			"id": 2,
			"label": "Activity 1",
			"title": "Leveraging Big Data and Data Science",
			"type": "Individual Work",
			"date": "October 14, 2024",
			"grade": "48/50",
			"reflection": "In this activity, I learned how big data and data science can help solve real problems. I found out how things like predictive analytics and clustering can give useful insights. It also made me aware of the challenges in using data, like managing poor-quality data and working with others to make it effective.",
			"link": "midterms/act1.pdf"
		},
		{
			"id": 3,
			"label": "Activity 3",
			"title": "Working with Vectors and Data Frames",
			"type": "Individual",
			"date": "November 23, 2024",
			"grade": "- / 20",
			"reflection": "This activity helped me understand how to work with vectors and data frames in R. I learned how to get specific data, add new columns, and fix missing values. It was a good practice for working with structured data in simple ways.",
			"link": "midterms/act3.pdf"
		},
		{
			"id": 4,
			"label": "Activity 4",
			"title": "Manipulating and Merging Data",
			"type": "Individual",
			"date": "November 23, 2024",
			"grade": "- / 20",
			"reflection": "This activity taught me how to combine and organize data so it’s easier to use. I practiced joining tables and grouping data, which made me realize how useful these skills are for working with larger datasets.",
			"link": "midterms/act4.pdf"
		},
		{
			"id": 5,
			"label": "Activity 5",
			"title": "Using Built-in Functions and Control Structures",
			"type": "Individual",
			"date": "November 23, 2024",
			"grade": "- / 20",
			"reflection": "This activity showed me how to use R’s built-in functions and control structures to write better code. I learned how to make functions reusable and write code that checks conditions, which are useful skills for solving everyday coding problems.",
			"link": "midterms/act5.pdf"
		},
		{
			"id": 6,
			"label": "Activity 6",
			"title": "Using APPLY Family FUNCTIONS",
			"type": "Individual",
			"date": "November 23, 2024",
			"grade": "- / 20",
			"reflection": "Using the APPLY family of functions helped me see how to make my code shorter and simpler. I practiced applying these functions to tasks like calculating averages and filtering data. It made repetitive tasks much easier and saved a lot of time.",
			"link": "midterms/act6.pdf"
		}
	]
}
